const arrMovieSet = [

	{ id: '_5+' 		, title: '&#10030; 5+' 		, },
	{ id: '_5' 			, title: '&#10003; 5' 		, },
	{ id: 'kinoman' 	, title: 'Кіноман' 			, },
	//{ id: '_007' 	, title: 'Агент 007' 	, },

];






const arrMovieSort = [

	//{ id: 'abc' 	, title: 'Алфавіт' 		, },
	{ id: 'year_up' 	, title: 'Рік +' 			, },
	{ id: 'year_down' 	, title: 'Рік -' 			, },

];





/*
В случае убийства набирайте «М» (1954)
Границы безумия (2022)
Живое (2017)
Жизнь Дэвида Гейла (2003)




*/




const arrSetKinoman  = [


	'13_sins_2014' 								, // 13 гріхів
	'1917_2019' 								, // 1917






	'avatar_2009' 								, // Аватар
	'avatar_2_2022' 							, // Аватар - 2
	'the_devil_s_advocate_1997' 				, // Адвокат диявола
	'upgrade_2018' 								, // Апгрейд
	'armageddon_1998' 							, // Армагеддон
	'face_off_1997' 							, // Без обличчя
	'beetlejuice_2024' 							, // Бітлджюс Бітлджюс
	'fight_club_1999' 							, // Бійцівський клуб
	'van_helsing_2004' 							, // Ван Хелсінг
	'venom_2018' 								, // Веном
	'venom_let_there_be_carnage_2021' 			, // Веном - 2
	'willow_1988' 								, // Віллоу
	'the_crow_2024' 							, // Ворон
	'hot_shots_2_1993' 							, // Гарячі голови - 2
	'gladiator_2000' 							, // Гладіатор
	'the_killer_s_game_2024' 					, // Гра кілера
	'le_comte_de_monte_cristo_2024' 			, // Граф Монте-Крісто
	'gemini_man_2019' 							, // Двійник
	'the_devil_s_double_20011' 					, // Двійник диявола
	'deja_vu_2006' 								, // Дежа вю
	'joker_2019' 								, // Джокер
	'the_ring_2002'								, // Дзвінок
	'detained_2024' 							, // Затримана
	'klatwa_doliny_wezy_1987' 					, // Закляття долини змій
	'trap_2024' 								, // Западня
	'abgeschnitten_2018' 						, // Ізоляція
	'the_foreigner_2017' 						, // Іноземець
	'influencer_2022' 							, // Інфлюенсер
	'the_skeleton_key_2005' 					, // Ключ від усіх дверей
	'amber_alert_2024' 							, // Код жовтий
	'jolt_2021' 								, // Красуня на драйві
	'cube_2_hypercube_2002' 					, // Куб - 2
	'labyrinth_1986' 							, // Лабіринт
	'into_the_blue_2005' 						, // Ласкаво просимо до раю
	'leon_1994' 								, // Леон
	'bad_genius_2024' 							, // Ліга мільйонерів
	'die_hard_4_2007' 							, // Міцний горішок - 4
	'live_die_repeat_edge_of_tomorrow_2014' 	, // На межі майбутнього
	'nowhere_2023' 								, // Ніде
	'knives_out_2019'							, // Ножі наголо
	'entrapment_1999' 							, // Пастка
	'hypnotic_2023' 							, // Під гіпнозом
	'source_code_2011' 							, // Початковий код
	'road_house_2024' 							, // Придорожній клуб
	'ghosted_2023' 								, // Примарні
	'tenet_2020' 								, // Тенет
	'tremors_1990' 								, // Тремтіння землі
	'miller_s_girl_2024' 						, // Фаворитка Міллера
	'the_godfather_1972' 						, // Хрещений батько
	'mr_brooks_2007' 							, // Хто Ви містере Брукс
	'it_s_what_s_inside_2024' 					, // Хто ти всередині
	'in_time_2011' 								, // Час


	'boss_level_2020' 							, // Boss Level: Фінальна гра



	'', //
	'', //
	'', //
	'', //
	'', //
	'', //
	'', //
	'', //
	'', //
	'', //
	'', //
	'', //
	'', //
	'', //



,

/*



  




Лицо со шрамом (1983)
Лобстер (2015)
Ловушка времени (2017)
Марс атакует (1996)
Матрица (1999)
Матрица - 2. Перезагрузка (2003)
Меган (2024)
Меню (2022)
Мина (2016)
Миссия невыполнима - 7 (2023)
Морбиус (2022)
На гребне волны (1991)
На игле (1996)
На крючке (2008)
Наемные убийцы (1995)
Назад в будущее (1985)
Назад в будущее - 2 (1989)
Назад в будущее - 3 (1990)
Наркоз (2007) 
Начало (2010)
Не вешайте трубку (2016)
Невидимка (2000)
Нечто (1982)
Нечто (2011)
Ниндзя из Беверли-Хиллз (1997)
Няньки (1994)
Обитель зла (2002)
Обитель проклятых (2014)
Области тьмы (2011)
Обряд (2011)
Озеро Каддо (2024)
Оса (2024)
Основной инстинкт (1992)
Особняк с привидениями (2023)
Особое мнение (2002)
Остров (2005)
Охотники на ведьм (2013) 
Падение Олимпа (2013)
Пароль Рыба-Меч (2001)
Парфюмер (2006)
Патруль времени (1994)
Патруль времени (2014)
Пацанская история (2022)
Пещера (2005)
Пёрл Харбор (2001)
Платформа (2019)
Платформа - 2 (2024)
Плохие парни (2024)
Полицейская тачка (2015)
Полицейский из Беверли-Хиллз (2024)
Помни (2000)
Попутчик (1986)
Последний киногерой (1993)
Почерк киллера (2024)
Право на убийство (2008)
Продавец (2009)
Пророк (2007)
Профессионал / Отпущение грехов (2024)
Пчеловод (2024)
Пьяный мастер (1978)
Пятый элемент (1997)
Пятьдесят оттенков серого (2015)
Рай (2023)
Рейд (2011)
Рекрут (2003)
Ролевые игры / Моя жена киллер (2024)
Рэмпейдж (2018)
С меня хватит (1993)
Самаритянин (2022)
Самый быстрый Индиан (2005)
Святые из Бундока (1999)
Сердце Дракона (1996)
Серый человек (2022)
Сикарио / Убийца (2015)
Сквозь снег (2013)
Скорость (1994)
Смокинг (2002)
Собиратель душ (2024)   
Союз (2024)
Спасти рядового Райана (1998)
Странный Томас (2013)
Субстанция (2024)
Судья Дредд (2012)
Тайлер Рейк: Операция по спасению 2 / Эвакуация 2 (2023)
Тело Дженифер (2009)
Терминал (2004)
Титаник (1997)
Трасса 60 (2002)
Три секунды (2019)
Тринадцатий воин (1999)
Турист (2010)
Убийственная жара (2024)
Ужасающий - 3 (2024)
Улыбка - 2 (2024)
Ученик. Восхождение Трампа (2024)
Форрест Гамп (1994)
Фуриоза: Безумный Макс (2024)
Хеллбой (2024)
Химера (2009)
Хищные земли (2024)
Хэллоуин (2018)
Хэллоуин убивает (2021)
Чего хотят женщины (2000)
Черная канарейка (2024)
Чужой: Ромул (2024)
Шоугелз (1995)
Экзамен (2009)
Эксперимент (2010)
Экстрасенс (2011)
Эффект парадокса (2024)
Я - легенда (2007)
Ячейка 234 (2024)


--- сериалы ----

Бумажный дом (2017)
Голяк (2019)
Дисклеймер / Все совпадения неслучайны (2024)
Друзья (1994)
Задача трех тел (2024)
Игра в кальмара (2021)
Игра престолов (2011)
Извне (2022)
Почему женщины убивают (2019)
Фоллаут (2024)


--- мультфильмы ---

Дом (2015)
Душа (2020)
Зверополис (2016)
Корпорация монстров (2001)
Красавица и чудовище (1991)
Ледниковый период (2002)
Тачки (2006)


*/




];
















const arrSetNation  = [

	'the_mexican_2001', // нема в базі // https://www.imdb.com/title/tt0236493/
	'',


];























